espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_eco5_struct.h
/** Type of int_ena register
 *  Interrupt enable bits
 */
typedef union {
    struct {
        /** ch0_tx_end_int_ena : R/W; bitpos: [0]; default: 0;
         *  The interrupt enable bit for CH0_TX_END_INT.
         */
        uint32_t ch0_tx_end_int_ena:1;
        /** ch1_tx_end_int_ena : R/W; bitpos: [1]; default: 0;
         *  The interrupt enable bit for CH1_TX_END_INT.
         */
        uint32_t ch1_tx_end_int_ena:1;
        /** ch2_tx_end_int_ena : R/W; bitpos: [2]; default: 0;
         *  The interrupt enable bit for CH2_TX_END_INT.
         */
        uint32_t ch2_tx_end_int_ena:1;
        /** ch3_tx_end_int_ena : R/W; bitpos: [3]; default: 0;
         *  The interrupt enable bit for CH3_TX_END_INT.
         */
        uint32_t ch3_tx_end_int_ena:1;
        /** ch0_err_int_ena : R/W; bitpos: [4]; default: 0;
         *  The interrupt enable bit for CH0_ERR_INT.
         */
        uint32_t ch0_err_int_ena:1;
        /** ch1_err_int_ena : R/W; bitpos: [5]; default: 0;
         *  The interrupt enable bit for CH1_ERR_INT.
         */
        uint32_t ch1_err_int_ena:1;
        /** ch2_err_int_ena : R/W; bitpos: [6]; default: 0;
         *  The interrupt enable bit for CH2_ERR_INT.
         */
        uint32_t ch2_err_int_ena:1;
        /** ch3_err_int_ena : R/W; bitpos: [7]; default: 0;
         *  The interrupt enable bit for CH3_ERR_INT.
         */
        uint32_t ch3_err_int_ena:1;
        /** ch0_tx_thr_event_int_ena : R/W; bitpos: [8]; default: 0;
         *  The interrupt enable bit for CH0_TX_THR_EVENT_INT.
         */
        uint32_t ch0_tx_thr_event_int_ena:1;
        /** ch1_tx_thr_event_int_ena : R/W; bitpos: [9]; default: 0;
         *  The interrupt enable bit for CH1_TX_THR_EVENT_INT.
         */
        uint32_t ch1_tx_thr_event_int_ena:1;
        /** ch2_tx_thr_event_int_ena : R/W; bitpos: [10]; default: 0;
         *  The interrupt enable bit for CH2_TX_THR_EVENT_INT.
         */
        uint32_t ch2_tx_thr_event_int_ena:1;
        /** ch3_tx_thr_event_int_ena : R/W; bitpos: [11]; default: 0;
         *  The interrupt enable bit for CH3_TX_THR_EVENT_INT.
         */
        uint32_t ch3_tx_thr_event_int_ena:1;
        /** ch0_tx_loop_int_ena : R/W; bitpos: [12]; default: 0;
         *  The interrupt enable bit for CH0_TX_LOOP_INT.
         */
        uint32_t ch0_tx_loop_int_ena:1;
        /** ch1_tx_loop_int_ena : R/W; bitpos: [13]; default: 0;
         *  The interrupt enable bit for CH1_TX_LOOP_INT.
         */
        uint32_t ch1_tx_loop_int_ena:1;
        /** ch2_tx_loop_int_ena : R/W; bitpos: [14]; default: 0;
         *  The interrupt enable bit for CH2_TX_LOOP_INT.
         */
        uint32_t ch2_tx_loop_int_ena:1;
        /** ch3_tx_loop_int_ena : R/W; bitpos: [15]; default: 0;
         *  The interrupt enable bit for CH3_TX_LOOP_INT.
         */
        uint32_t ch3_tx_loop_int_ena:1;
        /** ch4_rx_end_int_ena : R/W; bitpos: [16]; default: 0;
         *  The interrupt enable bit for CH4_RX_END_INT.
         */
        uint32_t ch4_rx_end_int_ena:1;
        /** ch5_rx_end_int_ena : R/W; bitpos: [17]; default: 0;
         *  The interrupt enable bit for CH5_RX_END_INT.
         */
        uint32_t ch5_rx_end_int_ena:1;
        /** ch6_rx_end_int_ena : R/W; bitpos: [18]; default: 0;
         *  The interrupt enable bit for CH6_RX_END_INT.
         */
        uint32_t ch6_rx_end_int_ena:1;
        /** ch7_rx_end_int_ena : R/W; bitpos: [19]; default: 0;
         *  The interrupt enable bit for CH7_RX_END_INT.
         */
        uint32_t ch7_rx_end_int_ena:1;
        /** ch4_err_int_ena : R/W; bitpos: [20]; default: 0;
         *  The interrupt enable bit for CH4_ERR_INT.
         */
        uint32_t ch4_err_int_ena:1;
        /** ch5_err_int_ena : R/W; bitpos: [21]; default: 0;
         *  The interrupt enable bit for CH5_ERR_INT.
         */
        uint32_t ch5_err_int_ena:1;
        /** ch6_err_int_ena : R/W; bitpos: [22]; default: 0;
         *  The interrupt enable bit for CH6_ERR_INT.
         */
        uint32_t ch6_err_int_ena:1;
        /** ch7_err_int_ena : R/W; bitpos: [23]; default: 0;
         *  The interrupt enable bit for CH7_ERR_INT.
         */
        uint32_t ch7_err_int_ena:1;
        /** ch4_rx_thr_event_int_ena : R/W; bitpos: [24]; default: 0;
         *  The interrupt enable bit for CH4_RX_THR_EVENT_INT.
         */
        uint32_t ch4_rx_thr_event_int_ena:1;
        /** ch5_rx_thr_event_int_ena : R/W; bitpos: [25]; default: 0;
         *  The interrupt enable bit for CH5_RX_THR_EVENT_INT.
         */
        uint32_t ch5_rx_thr_event_int_ena:1;
        /** ch6_rx_thr_event_int_ena : R/W; bitpos: [26]; default: 0;
         *  The interrupt enable bit for CH6_RX_THR_EVENT_INT.
         */
        uint32_t ch6_rx_thr_event_int_ena:1;
        /** ch7_rx_thr_event_int_ena : R/W; bitpos: [27]; default: 0;
         *  The interrupt enable bit for CH7_RX_THR_EVENT_INT.
         */
        uint32_t ch7_rx_thr_event_int_ena:1;
        /** ch3_dma_access_fail_int_ena : R/W; bitpos: [28]; default: 0;
         *  The interrupt enable bit for CH3_DMA_ACCESS_FAIL_INT.
         */
        uint32_t ch3_dma_access_fail_int_ena:1;
        /** ch7_dma_access_fail_int_ena : R/W; bitpos: [29]; default: 0;
         *  The interrupt enable bit for CH7_DMA_ACCESS_FAIL_INT.
         */
        uint32_t ch7_dma_access_fail_int_ena:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} rmt_int_ena_reg_t;

/** Type of int_clr register
 *  Interrupt clear bits
 */
typedef union {
    struct {
        /** ch0_tx_end_int_clr : WT; bitpos: [0]; default: 0;
         *  Set this bit to clear theCH0_TX_END_INT interrupt.
         */
        uint32_t ch0_tx_end_int_clr:1;
        /** ch1_tx_end_int_clr : WT; bitpos: [1]; default: 0;
         *  Set this bit to clear theCH1_TX_END_INT interrupt.
         */
        uint32_t ch1_tx_end_int_clr:1;
        /** ch2_tx_end_int_clr : WT; bitpos: [2]; default: 0;
         *  Set this bit to clear theCH2_TX_END_INT interrupt.
         */
        uint32_t ch2_tx_end_int_clr:1;
        /** ch3_tx_end_int_clr : WT; bitpos: [3]; default: 0;
         *  Set this bit to clear theCH3_TX_END_INT interrupt.
         */
        uint32_t ch3_tx_end_int_clr:1;
        /** ch0_err_int_clr : WT; bitpos: [4]; default: 0;
         *  Set this bit to clear theCH0_ERR_INT interrupt.
         */
        uint32_t ch0_err_int_clr:1;
        /** ch1_err_int_clr : WT; bitpos: [5]; default: 0;
         *  Set this bit to clear theCH1_ERR_INT interrupt.
         */
        uint32_t ch1_err_int_clr:1;
        /** ch2_err_int_clr : WT; bitpos: [6]; default: 0;
         *  Set this bit to clear theCH2_ERR_INT interrupt.
         */
        uint32_t ch2_err_int_clr:1;
        /** ch3_err_int_clr : WT; bitpos: [7]; default: 0;
         *  Set this bit to clear theCH3_ERR_INT interrupt.
         */
        uint32_t ch3_err_int_clr:1;
        /** ch0_tx_thr_event_int_clr : WT; bitpos: [8]; default: 0;
         *  Set this bit to clear theCH0_TX_THR_EVENT_INT interrupt.
         */
        uint32_t ch0_tx_thr_event_int_clr:1;
        /** ch1_tx_thr_event_int_clr : WT; bitpos: [9]; default: 0;
         *  Set this bit to clear theCH1_TX_THR_EVENT_INT interrupt.
         */
        uint32_t ch1_tx_thr_event_int_clr:1;
        /** ch2_tx_thr_event_int_clr : WT; bitpos: [10]; default: 0;
         *  Set this bit to clear theCH2_TX_THR_EVENT_INT interrupt.
         */
        uint32_t ch2_tx_thr_event_int_clr:1;
        /** ch3_tx_thr_event_int_clr : WT; bitpos: [11]; default: 0;
         *  Set this bit to clear theCH3_TX_THR_EVENT_INT interrupt.
         */
        uint32_t ch3_tx_thr_event_int_clr:1;
        /** ch0_tx_loop_int_clr : WT; bitpos: [12]; default: 0;
         *  Set this bit to clear theCH0_TX_LOOP_INT interrupt.
         */
        uint32_t ch0_tx_loop_int_clr:1;
        /** ch1_tx_loop_int_clr : WT; bitpos: [13]; default: 0;
         *  Set this bit to clear theCH1_TX_LOOP_INT interrupt.
         */
        uint32_t ch1_tx_loop_int_clr:1;
        /** ch2_tx_loop_int_clr : WT; bitpos: [14]; default: 0;
         *  Set this bit to clear theCH2_TX_LOOP_INT interrupt.
         */
        uint32_t ch2_tx_loop_int_clr:1;
        /** ch3_tx_loop_int_clr : WT; bitpos: [15]; default: 0;
         *  Set this bit to clear theCH3_TX_LOOP_INT interrupt.
         */
        uint32_t ch3_tx_loop_int_clr:1;
        /** ch4_rx_end_int_clr : WT; bitpos: [16]; default: 0;
         *  Set this bit to clear theCH4_RX_END_INT interrupt.
         */
        uint32_t ch4_rx_end_int_clr:1;
        /** ch5_rx_end_int_clr : WT; bitpos: [17]; default: 0;
         *  Set this bit to clear theCH5_RX_END_INT interrupt.
         */
        uint32_t ch5_rx_end_int_clr:1;
        /** ch6_rx_end_int_clr : WT; bitpos: [18]; default: 0;
         *  Set this bit to clear theCH6_RX_END_INT interrupt.
         */
        uint32_t ch6_rx_end_int_clr:1;
        /** ch7_rx_end_int_clr : WT; bitpos: [19]; default: 0;
         *  Set this bit to clear theCH7_RX_END_INT interrupt.
         */
        uint32_t ch7_rx_end_int_clr:1;
        /** ch4_err_int_clr : WT; bitpos: [20]; default: 0;
         *  Set this bit to clear theCH4_ERR_INT interrupt.
         */
        uint32_t ch4_err_int_clr:1;
        /** ch5_err_int_clr : WT; bitpos: [21]; default: 0;
         *  Set this bit to clear theCH5_ERR_INT interrupt.
         */
        uint32_t ch5_err_int_clr:1;
        /** ch6_err_int_clr : WT; bitpos: [22]; default: 0;
         *  Set this bit to clear theCH6_ERR_INT interrupt.
         */
        uint32_t ch6_err_int_clr:1;
        /** ch7_err_int_clr : WT; bitpos: [23]; default: 0;
         *  Set this bit to clear theCH7_ERR_INT interrupt.
         */
        uint32_t ch7_err_int_clr:1;
        /** ch4_rx_thr_event_int_clr : WT; bitpos: [24]; default: 0;
         *  Set this bit to clear theCH4_RX_THR_EVENT_INT interrupt.
         */
        uint32_t ch4_rx_thr_event_int_clr:1;
        /** ch5_rx_thr_event_int_clr : WT; bitpos: [25]; default: 0;
         *  Set this bit to clear theCH5_RX_THR_EVENT_INT interrupt.
         */
        uint32_t ch5_rx_thr_event_int_clr:1;
        /** ch6_rx_thr_event_int_clr : WT; bitpos: [26]; default: 0;
         *  Set this bit to clear theCH6_RX_THR_EVENT_INT interrupt.
         */
        uint32_t ch6_rx_thr_event_int_clr:1;
        /** ch7_rx_thr_event_int_clr : WT; bitpos: [27]; default: 0;
         *  Set this bit to clear theCH7_RX_THR_EVENT_INT interrupt.
         */
        uint32_t ch7_rx_thr_event_int_clr:1;
        /** ch3_dma_access_fail_int_clr : WT; bitpos: [28]; default: 0;
         *  Set this bit to clear the CH3_DMA_ACCESS_FAIL_INT interrupt.
         */
        uint32_t ch3_dma_access_fail_int_clr:1;
        /** ch7_dma_access_fail_int_clr : WT; bitpos: [29]; default: 0;
         *  Set this bit to clear the CH7_DMA_ACCESS_FAIL_INT interrupt.
         */
        uint32_t ch7_dma_access_fail_int_clr:1;
        uint32_t reserved_30:2;
    };
    uint32_t val;
} rmt_int_clr_reg_t;


/** Group: Carrier wave duty cycle registers */
/** Type of chncarrier_duty register
 *  Channel n duty cycle configuration register
 */
typedef union {
    struct {
        /** carrier_low_chn : R/W; bitpos: [15:0]; default: 64;
         *  This register is used to configure carrier wave 's low level clock period for
         *  CHANNELn.
         */
        uint32_t carrier_low_chn:16;
        /** carrier_high_chn : R/W; bitpos: [31:16]; default: 64;
         *  This register is used to configure carrier wave 's high level clock period for
         *  CHANNELn.
         */
        uint32_t carrier_high_chn:16;
    };
    uint32_t val;
} rmt_chncarrier_duty_reg_t;


/** Group: Tx event configuration registers */
/** Type of chn_tx_lim register
 *  Channel n Tx event configuration register
 */
typedef union {
    struct {
        /** tx_lim_chn : R/W; bitpos: [8:0]; default: 128;
         *  This register is used to configure the maximum entries that CHANNELn can send out.
         */
        uint32_t tx_lim_chn:9;
        /** tx_loop_num_chn : R/W; bitpos: [18:9]; default: 0;
         *  This register is used to configure the maximum loop count when tx_conti_mode is
         *  valid.
         */
        uint32_t tx_loop_num_chn:10;
        /** tx_loop_cnt_en_chn : R/W; bitpos: [19]; default: 0;
         *  This register is the enabled bit for loop count.
         */
        uint32_t tx_loop_cnt_en_chn:1;
        /** loop_count_reset_chn : WT; bitpos: [20]; default: 0;
         *  This register is used to reset the loop count when tx_conti_mode is valid.
         */
        uint32_t loop_count_reset_chn:1;
        /** loop_stop_en_chn : R/W; bitpos: [21]; default: 0;
         *  This bit is used to enable the loop send stop function after the loop counter
         *  counts to  loop number for CHANNELn.
         */
        uint32_t loop_stop_en_chn:1;
        uint32_t reserved_22:10;
    };
    uint32_t val;
} rmt_chn_tx_lim_reg_t;

/** Type of tx_sim register
 *  RMT TX synchronous register
 */
typedef union {
    struct {
        /** tx_sim_ch0 : R/W; bitpos: [0]; default: 0;
         *  Set this bit to enable CHANNEL0 to start sending data synchronously with other
         *  enabled channels.
         */
        uint32_t tx_sim_ch0:1;
        /** tx_sim_ch1 : R/W; bitpos: [1]; default: 0;
         *  Set this bit to enable CHANNEL1 to start sending data synchronously with other
         *  enabled channels.
         */
        uint32_t tx_sim_ch1:1;
        /** tx_sim_ch2 : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable CHANNEL2 to start sending data synchronously with other
         *  enabled channels.
         */
        uint32_t tx_sim_ch2:1;
        /** tx_sim_ch3 : R/W; bitpos: [3]; default: 0;
         *  Set this bit to enable CHANNEL3 to start sending data synchronously with other
         *  enabled channels.
         */
        uint32_t tx_sim_ch3:1;
        /** tx_sim_en : R/W; bitpos: [4]; default: 0;
         *  This register is used to enable multiple of channels to start sending data
         *  synchronously.
         */
        uint32_t tx_sim_en:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} rmt_tx_sim_reg_t;


