espressif/esp-idf/components/soc/esp32p4/register/hw_ver3/soc/rmt_eco5_struct.h
/** Group: Rx event configuration registers */
/** Type of chm_rx_lim register
 *  Channel m Rx event configuration register
 */
typedef union {
    struct {
        /** chm_rx_lim_reg : R/W; bitpos: [8:0]; default: 128;
         *  This register is used to configure the maximum entries that CHANNELm can receive.
         */
        uint32_t chm_rx_lim_reg:9;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} rmt_chm_rx_lim_reg_t;


/** Group: Version register */
/** Type of date register
 *  RMT version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [27:0]; default: 35655953;
         *  This is the version register.
         */
        uint32_t date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} rmt_date_reg_t;


typedef struct {
    volatile rmt_chndata_reg_t chndata[4];
    volatile rmt_chmdata_reg_t chmdata[4];
    volatile rmt_chnconf0_reg_t chnconf0[4];
    volatile rmt_chmconf0_reg_t ch4conf0;
    volatile rmt_chmconf1_reg_t ch4conf1;
    volatile rmt_chmconf0_reg_t ch5conf0;
    volatile rmt_chmconf1_reg_t ch5conf1;
    volatile rmt_chmconf0_reg_t ch6conf0;
    volatile rmt_chmconf1_reg_t ch6conf1;
    volatile rmt_chmconf0_reg_t ch7conf0;
    volatile rmt_chmconf1_reg_t ch7conf1;
    volatile rmt_chnstatus_reg_t chnstatus[4];
    volatile rmt_chmstatus_reg_t chmstatus[4];
    volatile rmt_int_raw_reg_t int_raw;
    volatile rmt_int_st_reg_t int_st;
    volatile rmt_int_ena_reg_t int_ena;
    volatile rmt_int_clr_reg_t int_clr;
    volatile rmt_chncarrier_duty_reg_t chncarrier_duty[4];
    volatile rmt_chm_rx_carrier_rm_reg_t chm_rx_carrier_rm[4];
    volatile rmt_chn_tx_lim_reg_t chn_tx_lim[4];
    volatile rmt_chm_rx_lim_reg_t chm_rx_lim[4];
    volatile rmt_sys_conf_reg_t sys_conf;
    volatile rmt_tx_sim_reg_t tx_sim;
    volatile rmt_ref_cnt_rst_reg_t ref_cnt_rst;
    volatile rmt_date_reg_t date;
} rmt_dev_t;

extern rmt_dev_t RMT;

#ifndef __cplusplus
_Static_assert(sizeof(rmt_dev_t) == 0xd0, "Invalid size of rmt_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
